namespace Shkolo.Data.Datasets.Seeders
{
    public class DataSeeder
    {
        public string[] DataDiary =
          {
                "ЗПГ","9","Е","Костадин Стефанов Митрев","2021",
                "ЗПГ","8","Е","Величка Георгиева Божинова","2021"
          };
        public string[] DataSubjects =
          {
                    "Български език и литература",
                    "Английски език",
                    "Френски език",
                    "Математика",
                    "Информационни технологии",
                    "История и цивилизации",
                    "География и икономика",
                    "Философия",
                    "Биология и здравно образование",
                    "Физика и астрономия",
                    "Химия и опазване на околната среда",
                    "Физическо възпитание и спорт",
                    "Здравословни и безопасни условия на труд",
                    "Материалознание",
                    "Техническа механика",
                    "Основи на мехатрониката",
                    "Основи на хидравлични и пневматични устройства",
                    "Теория на двигатели с вътрешно горене",
                    "Учебна практика - по специалността",
                    "Спортни дейности (бадминтон)",
                    "Безопасност на движението",
                    "Час на класа"
        };

        public string[] DataTeachers =
        {
                    "Катя Иванова Петкова",
                    "Мария Василева Якимова-Кацарска",
                    "Мариам Таквор Гилигян-Зарарева",
                    "Сашка Андонова Николова",
                    "Елза Василева Булакиева",
                    "Красимира Любенова Пановска",
                    "Невена Иванова Шингарова-Кажова",
                    "Катя Методиева Дукова",
                    "Мая Димитрова Илиева",
                    "Костадин Стефанов Митрев",
                   "Снежана Николова Маламова",
                    "Роза Атанасова Иванова",
                    "Анелия Стоянова Калъмбова",
                    "Емил Иванов Терзийски",
                    "Снежанка Христова Кацарова",
                    "Божидар Георгиев Цулев",
                   "Александър Методиев Дерибанов",
                   "Ботьо Димитров Пенев",
                   "Мариана Александрова Ризова",
                   "Иван Костадинов Попов",
                   "Благовест Георгиев Илиев",
                   "Стефани Николаева Мездрова-Кирова",
                   "Харалампи Иванов Иванов",
                   "Мария Илиева Кацарова",
                   "Петранка Захариева Михайлова",
                   "Величка Георгиева Божинова",
                   "Валентина Димитрова Мутафчиева",
                   "Димитринка Любенова Мешкова",
         };

        public string[] DataTypeSubjects =
        {
                    "ООП",
                    "ОбПП",
                    "ИУЧ - ОтПП",
                    "ИУЧ - РПП",
                    "…"
        };

        public string[] DataTypeAbsences =
        {
                    "Уважително",
                    "Неуважително",
                    "Закъснение",
                    ""
        };

        public string[] DataTypeAbsencesReason =
        {
                    "Здравословни",
                    "Семейни",
                    "Други",
                    ""
        };

        public string[] DataTypeGrade =
        {
                    "Устно изпитване",
                    "Писмено изпитване",
                    "Практическо изпитване",
                    "Тест",
                    "Активно участие",
                    "Самостоятелна работа",
                    "Домашна работа",
                    "Контролна работа",
                    "Класна работа",
                    "Входно равнище",
                    "Междинно равнище",
                    "Изходно равнище",
                    "Срочна",
                    "Годишна",
                    "От друго училище",
                    "От друга паралелка",
                    "Проект"
        };

        public string[] DataCourses = {
                    "Български език и литература","ООП","Катя Иванова Петкова",
                    "Английски език", "ООП", "Мария Василева Якимова-Кацарска",
                    "Френски език", "ООП", "Мариам Таквор Гилигян-Зарарева",
                    "Математика","ООП","Сашка Андонова Николова",
                    "Информационни технологии","ООП","Елза Василева Булакиева",
                    "Информационни технологии","ООП","Красимира Любенова Пановска",
                    "История и цивилизации","ООП","Невена Иванова Шингарова-Кажова",
                    "География и икономика","ООП","Катя Методиева Дукова",
                    "Философия","ООП","Роза Атанасова Иванова",
                    "Биология и здравно образование","ООП","Анелия Стоянова Калъмбова",
                    "Физика и астрономия","ООП","Емил Иванов Терзийски",
                    "Химия и опазване на околната среда","ООП","Мая Димитрова Илиева",
                    "Физическо възпитание и спорт","ООП","Костадин Стефанов Митрев",
                    "Здравословни и безопасни условия на труд","ОбПП","Снежана Николова Маламова",
                    "Материалознание","ИУЧ - ОтПП","Снежанка Христова Кацарова",
                    "Техническа механика","ИУЧ - ОтПП","Снежанка Христова Кацарова",
                    "Основи на мехатрониката","ИУЧ - РПП","Снежанка Христова Кацарова",
                    "Основи на хидравлични и пневматични устройства","ИУЧ - РПП","Снежанка Христова Кацарова",
                    "Теория на двигатели с вътрешно горене","ИУЧ - РПП","Снежанка Христова Кацарова",
                    "Учебна практика - по специалността","ИУЧ - РПП","Божидар Георгиев Цулев",
                    "Учебна практика - по специалността","ИУЧ - РПП","Александър Методиев Дерибанов",
                    "Спортни дейности (бадминтон)","…","Костадин Стефанов Митрев",
                    "Безопасност на движението","…","Александър Методиев Дерибанов",
                    "Български език и литература","ООП","Ботьо Димитров Пенев",
                    "Математика","ООП","Мариана Александрова Ризова",
                    "Математика","ООП","Иван Костадинов Попов",
                    "География и икономика","ООП","Благовест Георгиев Илиев",
                    "География и икономика","ООП","Стефани Николаева Мездрова-Кирова",
                    "Биология и здравно образование","ООП","Величка Георгиева Божинова",
                    "Физика и астрономия","ООП","Валентина Димитрова Мутафчиева",
                    "Философия","ООП","Харалампи Иванов Иванов",
                    "Философия","ООП","Мария Илиева Кацарова",
                    "Философия","ООП","Петранка Захариева Михайлова",
                    "Химия и опазване на околната среда","ООП","Димитринка Любенова Мешкова",
                    "Английски език", "ООП", "Мариам Таквор Гилигян-Зарарева",
                    "Час на класа","…","Костадин Стефанов Митрев"
        };

        public string[] DataStudents = {

                    "Асен Радославов Калоянов","2005-08-11","Сандански","Улица No 47","+359892935556","1","Български език и литература","ООП","Катя Иванова Петкова","Стефка Асенова Калоянова","+359893379212","null","null","Димитър  Гогушев","0881391496/2","167/134","null","null",
                    "Асен Росенов Методиев","2004-11-25","Сандански"," Улица  No 15","+359894460845","2","Български език и литература","ООП","Катя Иванова Петкова","Елена Стойчева Иванова","+359893893829","null","null","Маргарита  Ламбрева","+359737001958","147/160","null","null",
                    "Иван Китанов Гуров","2005-07-24","Сандански","Улица  No 7","+359845460846","3","Български език и литература","ООП","Катя Иванова Петкова","Величка Иванова Гурова","+359893093827","vilivvezarova88@gmail.com","null","Радослав  Чупетловски","+359812391200","169/137","null","null",
                    "Илия Горанов Аргиров","2005-11-04","Сандански"," Улица No 15","+359896793517","4","Български език и литература","ООП","Катя Иванова Петкова","Росица  Аргирова","+359893304689","rosicaargirova55@gmail.com","null","Илиана  Харискова","+359717884709","169/138","null","null",
                    "Илияна Малинова Шуманска","2005-04-11","Сандански","null","+359873658504","5","Български език и литература","ООП","Катя Иванова Петкова","Димитър  Шумански","+359884877090","null","null","Илиана  Харискова","+359888484709","169/139","null","null",
                    "Исмаела Антонова Резанска","2005-11-12","Сандански","Улица  No 6","+359825331726","6","Български език и литература","ООП","Катя Иванова Петкова","Антон  Резански","+359812990384","null","null","д-р  Николова","+359811926650","169/140","null","null",
                    "Йорданка Георгиева Шишева","2005-01-28","Сандански","Улица  No 7","+359886115160","7","Български език и литература","ООП","Катя Иванова Петкова","Георги  Шишев","+359878994310","null","null","Доктор  Темелкова","+359888348778","169/141","null","null",
                    "Йордан Атанасов Ризов","2005-06-27","Сандански","Улица  No 11","+3598762492430","8","Български език и литература","ООП","Катя Иванова Петкова","Стойчо  Ризова","+359876158999","desi.ralkova12@abv.bg","null","Доктор  Гогушев","+359871391996","169/143","null","null",
                    "Киро Атанасов Капитански","2005-10-23","Сандански","Улица  No 59","+359867599474","9","Български език и литература","ООП","Катя Иванова Петкова","Димитрина  Капитанска","+359893301211","dimitrinacorocono32@gmail.com","null","Д-Р Ивелина  Станоева","+359809810845","169/144","null","null",
                    "Любена Симеонова Резова","2006-09-27","Сандански"," Улица  No 11","+359894115218","10","Български език и литература","ООП","Катя Иванова Петкова","Таня  Резова","+359879732502","null","null","Ваня  Мишева","+359898199924","169/145","null","null",
                    "Манол Ризов Бекяров","2004-11-01","Сандански"," Улица No 26","+359877746603","11","Български език и литература","ООП","Катя Иванова Петкова","Юлияна  Бекярова","+359893323859","null","null","Любен  Янков","+359888673420","147/161","null","null",
                    "Малин Захариев Тодоров","2005-07-11","Сандански","Улица  No 18","+359878377599","12","Български език и литература","ООП","Катя Иванова Петкова","Димитър  Тодоров","+359888559905","null","null","Д- Р Явор  Павлов","+359812659032","169/146","null","null",
                    "Николай Асенов Ристочков","2006-05-12","Сандански","Улица  No 11","+359895852714","13","Български език и литература","ООП","Катя Иванова Петкова","Виолета  Ристоцкова","+359898124323","srebarnovavioleta23@abv.bg","null","д-р  Георгиева","+359871981461","169/147","null","null",
                    "Николина Малчева Трайкова","2006-12-22","Сандански","Улица  Nov25","+359844050435","14","Български език и литература","ООП","Катя Иванова Петкова","Красимира Алексиева Трайкова","+359871300503","null","null","Д- Р Явор  Павлов","+359891259032","173/9","null","null",
                    "Ради Александров Соколов","2005-04-22","Сандански","null","+359896115061","15","Български език и литература","ООП","Катя Иванова Петкова","Александър  Соколов","+359892448009","null","null","Маргарита  Ламбрева","+359887231958","169/148","null","null",
                    "Рамон Ангелов Кокочевски","2006-07-27","Сандански","Улица  No 2","+359894125596","16","Български език и литература","ООП","Катя Иванова Петкова","Филка  Кокочевска","+359835721228","null","null","Радослав  Чупетловски","+359884591200","169/149","null","null",
                    "Симо Алек Неновски","2005-06-22","Сандански","Улица  No 3","+359896513318","17","Български език и литература","ООП","Катя Иванова Петкова","Александър  Неновски","+359894453829","null","null","Д- Р Явор  Павлов","+359898159032","169/150","null","null",
                    "Симеон Симеонов Петровски","2007-09-12","Сандански","Улица №123","+359457667423","18","Български език и литература","ООП","Катя Иванова Петкова","Силвия  Петровска","+359845515736","Vanitami@abv.bg","null","д-р  Турнов","+359887355743","173/11","null","null",
                    "Юлия Ненова Юлиянова","2005-11-17","Сандански"," Улица  No 20","+359873739252","19","Български език и литература","ООП","Катя Иванова Петкова","Найчо  Юлианова","+359893343829","null","null","Доктор  Темелкова","+359882218778","147/162","null","null",
                    "Петра Стефанова Чикорова","2006-01-11","Харманли","Улица  № 12","+359899948227","20","Български език и литература","ООП","Катя Иванова Петкова","Стоянка Иванова Чикорова","+359894129089","null","с. Троян","Антония  Желева","+359888224400","null","null","null",
                    "-","-","-","-","-","21","Български език и литература","ООП","Катя Иванова Петкова","Стоян Иванов Ангелов","+359894249088","null","null","Доктор  Темелков","+359884518777","null","null","null"

        };

        public string[] DataSchedules = {

                     "1","1","null","null","История и цивилизации","ООП","Невена Иванова Шингарова-Кажова"
                    ,"1","2","null","null","Физика и астрономия","ООП","Емил Иванов Терзийски"
                    ,"1","2","null","null","Физика и астрономия","ООП","Валентина Димитрова Мутафчиева"
                    ,"1","3","null","null","Френски език","ООП","Мариам Таквор Гилигян-Зарарева"
                    ,"1","4","null","null","Френски език","ООП","Мариам Таквор Гилигян-Зарарева"
                    ,"1","5","null","null","Основи на мехатрониката","ИУЧ - РПП","Снежанка Христова Кацарова"
                    ,"1","6","null","null","Теория на двигатели с вътрешно горене","ИУЧ - РПП","Снежанка Христова Кацарова"
                    ,"1","7","null","null","Спортни дейности (бадминтон)","…","Костадин Стефанов Митрев"
                    ,"2","1","null","null","Физическо възпитание и спорт","ООП","Костадин Стефанов Митрев"
                    ,"2","2","null","null","Биология и здравно образование","ООП","Анелия Стоянова Калъмбова"
                    ,"2","2","null","null","Биология и здравно образование","ООП","Величка Георгиева Божинова"
                    ,"2","3","null","null","Химия и опазване на околната среда","ООП","Мая Димитрова Илиева"
                    ,"2","3","null","null","Химия и опазване на околната среда","ООП","Димитринка Любенова Мешкова"
                    ,"2","4","null","null","Химия и опазване на околната среда","ООП","Мая Димитрова Илиева"
                    ,"2","4","null","null","Химия и опазване на околната среда","ООП","Димитринка Любенова Мешкова"
                    ,"2","5","null","null","Български език и литература","ООП","Катя Иванова Петкова"
                    ,"2","5","null","null","Български език и литература","ООП","Ботьо Димитров Пенев"
                    ,"2","6","null","null","Материалознание","ИУЧ - ОтПП","Снежанка Христова Кацарова"
                    ,"2","7","null","null","Основи на хидравлични и пневматични устройства","ИУЧ - РПП","Снежанка Христова Кацарова"
                    ,"3","1","null","null","Математика","ООП","Сашка Андонова Николова"
                    ,"3","1","null","null","Математика","ООП","Мариана Александрова Ризова"
                    ,"3","1","null","null","Математика","ООП","Иван Костадинов Попов"
                    ,"3","2","null","null","Математика","ООП","Сашка Андонова Николова"
                    ,"3","2","null","null","Математика","ООП","Мариана Александрова Ризова"
                    ,"3","2","null","null","Математика","ООП","Иван Костадинов Попов"
                    ,"3","3","null","null","История и цивилизации","ООП","Невена Иванова Шингарова-Кажова"
                    ,"3","4","null","null","Физическо възпитание и спорт","ООП","Костадин Стефанов Митрев"
                    ,"3","5","null","null","Български език и литература","ООП","Катя Иванова Петкова"
                    ,"3","5","null","null","Български език и литература","ООП","Ботьо Димитров Пенев"
                    ,"3","6","null","null","Български език и литература","ООП","Катя Иванова Петкова"
                    ,"3","6","null","null","Български език и литература","ООП","Ботьо Димитров Пенев"
                    ,"3","7","null","null","Час на класа","…","Костадин Стефанов Митрев"
                    ,"4","1","null","null","География и икономика","ООП","Катя Методиева Дукова"
                    ,"4","1","null","null","География и икономика","ООП","Благовест Георгиев Илиев"
                    ,"4","1","null","null","География и икономика","ООП","Стефани Николаева Мездрова-Кирова"
                    ,"4","2","null","null","Техническа механика","ИУЧ - ОтПП","Снежанка Христова Кацарова"
                    ,"4","3","null","null","Математика","ООП","Сашка Андонова Николова"
                    ,"4","3","null","null","Математика","ООП","Мариана Александрова Ризова"
                    ,"4","3","null","null","Математика","ООП","Иван Костадинов Попов"
                    ,"4","4","null","null","Философия","ООП","Роза Атанасова Иванова"
                    ,"4","4","null","null","Философия","ООП","Харалампи Иванов Иванов"
                    ,"4","4","null","null","Философия","ООП","Мария Илиева Кацарова"
                    ,"4","4","null","null","Философия","ООП","Петранка Захариева Михайлова"
                    ,"4","5","null","null","Информационни технологии","ООП","Красимира Любенова Пановска"
                    ,"4","5","null","null","Информационни технологии","ООП","Елза Василева Булакиева"
                    ,"4","6","null","null","Английски език","ООП","Мариам Таквор Гилигян-Зарарева"
                    ,"4","6","null","null","Английски език","ООП","Мария Василева Якимова-Кацарска"
                    ,"4","7","null","null","Английски език","ООП","Мариам Таквор Гилигян-Зарарева"
                    ,"4","7","null","null","Английски език","ООП","Мария Василева Якимова-Кацарска"
                    ,"5","1","null","null","Учебна практика - по специалността","ИУЧ - РПП","Александър Методиев Дерибанов"
                    ,"5","1","null","null","Учебна практика - по специалността","ИУЧ - РПП","Божидар Георгиев Цулев"
                    ,"5","2","null","null","Учебна практика - по специалността","ИУЧ - РПП","Александър Методиев Дерибанов"
                    ,"5","2","null","null","Учебна практика - по специалността","ИУЧ - РПП","Божидар Георгиев Цулев"
                    ,"5","3","null","null","Учебна практика - по специалността","ИУЧ - РПП","Александър Методиев Дерибанов"
                    ,"5","3","null","null","Учебна практика - по специалността","ИУЧ - РПП","Божидар Георгиев Цулев"
                    ,"5","4","null","null","Учебна практика - по специалността","ИУЧ - РПП","Александър Методиев Дерибанов"
                    ,"5","4","null","null","Учебна практика - по специалността","ИУЧ - РПП","Божидар Георгиев Цулев"
                    ,"5","6","null","null","Основи на хидравлични и пневматични устройства","ИУЧ - РПП","Снежанка Христова Кацарова"
                    ,"5","7","null","null","Теория на двигатели с вътрешно горене","ИУЧ - РПП","Снежанка Христова Кацарова"
                    ,"1","1","null","null","Учебна практика - по специалността","ИУЧ - РПП","Божидар Георгиев Цулев"
                    ,"1","1","null","null","Учебна практика - по специалността","ИУЧ - РПП","Александър Методиев Дерибанов"
                    ,"1","2","null","null","Учебна практика - по специалността","ИУЧ - РПП","Божидар Георгиев Цулев"
                    ,"1","2","null","null","Учебна практика - по специалността","ИУЧ - РПП","Александър Методиев Дерибанов"
                    ,"1","3","null","null","Учебна практика - по специалността","ИУЧ - РПП","Божидар Георгиев Цулев"
                    ,"1","3","null","null","Учебна практика - по специалността","ИУЧ - РПП","Александър Методиев Дерибанов"
                    ,"1","4","null","null","Учебна практика - по специалността","ИУЧ - РПП","Божидар Георгиев Цулев"
                    ,"1","4","null","null","Учебна практика - по специалността","ИУЧ - РПП","Александър Методиев Дерибанов"
                    ,"1","6","null","null","Математика","ООП","Сашка Андонова Николова"
                    ,"1","6","null","null","Математика","ООП","Мариана Александрова Ризова"
                    ,"1","6","null","null","Математика","ООП","Иван Костадинов Попов"
                    ,"1","7","null","null","Физика и астрономия","ООП","Емил Иванов Терзийски"
                    ,"1","7","null","null","Физика и астрономия","ООП","Валентина Димитрова Мутафчиева"
                    ,"2","1","null","null","Химия и опазване на околната среда","ООП","Мая Димитрова Илиева"
                    ,"2","1","null","null","Химия и опазване на околната среда","ООП","Димитринка Любенова Мешкова"
                    ,"2","2","null","null","Физическо възпитание и спорт","ООП","Костадин Стефанов Митрев"
                    ,"2","3","null","null","Български език и литература","ООП","Катя Иванова Петкова"
                    ,"2","3","null","null","Български език и литература","ООП","Ботьо Димитров Пенев"
                    ,"2","4","null","null","Български език и литература","ООП","Катя Иванова Петкова"
                    ,"2","4","null","null","Български език и литература","ООП","Ботьо Димитров Пенев"
                    ,"2","5","null","null","Философия","ООП","Роза Атанасова Иванова"
                    ,"2","5","null","null","Философия","ООП","Харалампи Иванов Иванов"
                    ,"2","5","null","null","Философия","ООП","Мария Илиева Кацарова"
                    ,"2","5","null","null","Философия","ООП","Петранка Захариева Михайлова"
                    ,"2","6","null","null","Английски език","ООП","Мария Василева Якимова-Кацарска"
                    ,"2","6","null","null","Английски език","ООП","Мариам Таквор Гилигян-Зарарева"
                    ,"2","7","null","null","Английски език","ООП","Мария Василева Якимова-Кацарска"
                    ,"2","7","null","null","Английски език","ООП","Мариам Таквор Гилигян-Зарарева"
                    ,"3","1","null","null","Техническа механика","ИУЧ - ОтПП","Снежанка Христова Кацарова"
                    ,"3","2","null","null","Материалознание","ИУЧ - ОтПП","Снежанка Христова Кацарова"
                    ,"3","3","null","null","Теория на двигатели с вътрешно горене","ИУЧ - РПП","Снежанка Христова Кацарова"
                    ,"3","4","null","null","История и цивилизации","ООП","Невена Иванова Шингарова-Кажова"
                    ,"3","5","null","null","Основи на хидравлични и пневматични устройства","ИУЧ - РПП","Снежанка Христова Кацарова"
                    ,"3","6","null","null","Физическо възпитание и спорт","ООП","Костадин Стефанов Митрев"
                    ,"3","7","null","null","Математика","ООП","Сашка Андонова Николова"
                    ,"3","7","null","null","Математика","ООП","Мариана Александрова Ризова"
                    ,"3","7","null","null","Математика","ООП","Иван Костадинов Попов"
                    ,"4","1","null","null","Български език и литература","ООП","Катя Иванова Петкова"
                    ,"4","1","null","null","Български език и литература","ООП","Ботьо Димитров Пенев"
                    ,"4","2","null","null","Основи на хидравлични и пневматични устройства","ИУЧ - РПП","Снежанка Христова Кацарова"
                    ,"4","3","null","null","Математика","ООП","Сашка Андонова Николова"
                    ,"4","3","null","null","Математика","ООП","Мариана Александрова Ризова"
                    ,"4","3","null","null","Математика","ООП","Иван Костадинов Попов"
                    ,"4","4","null","null","География и икономика","ООП","Катя Методиева Дукова"
                    ,"4","4","null","null","География и икономика","ООП","Благовест Георгиев Илиев"
                    ,"4","4","null","null","География и икономика","ООП","Стефани Николаева Мездрова-Кирова"
                    ,"4","5","null","null","Информационни технологии","ООП","Елза Василева Булакиева"
                    ,"4","5","null","null","Информационни технологии","ООП","Красимира Любенова Пановска"
                    ,"4","6","null","null","Спортни дейности (бадминтон)","…","Костадин Стефанов Митрев"
                    ,"4","7","null","null","Теория на двигатели с вътрешно горене","ИУЧ - РПП","Снежанка Христова Кацарова"
                    ,"5","1","null","null","Френски език","ООП","Мариам Таквор Гилигян-Зарарева"
                    ,"5","2","null","null","Френски език","ООП","Мариам Таквор Гилигян-Зарарева"
                    ,"5","3","null","null","Здравословни и безопасни условия на труд","ОбПП","Снежана Николова Маламова"
                    ,"5","4","null","null","Биология и здравно образование","ООП","Анелия Стоянова Калъмбова"
                    ,"5","4","null","null","Биология и здравно образование","ООП","Величка Георгиева Божинова"
                    ,"5","5","null","null","Основи на мехатрониката","ИУЧ - РПП","Снежанка Христова Кацарова"
                    ,"5","6","null","null","История и цивилизации","ООП","Невена Иванова Шингарова-Кажова"
                    ,"5","7","null","null","Час на класа","…","Костадин Стефанов Митрев"
                    

        };

    }
}
